Revit 2018 API
Parameter Methods
The Parameter type exposes the following members.
Methods
Name | Description
AsDouble
Provides access to the double precision number within the parameter.
AsElementId
Provides access to the Autodesk::Revit::DB::ElementId^ stored within the parameter.
AsInteger
Provides access to the integer number within the parameter.
AssociateWithGlobalParameter
 Associates this parameter with a global parameter in the same document.
AsString
Provides access to the string contents of the parameter.
AsValueString()
Get the parameter value as a string with units.
AsValueString(FormatOptions)
Get the parameter value as a string with units.
CanBeAssociatedWithGlobalParameter
 Tests whether this parameter can be associated with the given global parameter.
CanBeAssociatedWithGlobalParameters
 Tests whether this parameter can be associated with any global parameter.
DissociateFromGlobalParameter
 Dissociates this parameter from a global parameter.
GetAssociatedGlobalParameter
 Returns a global parameter, if any, currently associated with this parameter.
Set(Double)
Sets the parameter to a new real number value.
Set(Int32)
Sets the parameter to a new integer value.
Set(String)
Sets the parameter to a new string of text.
Set(ElementId)
Sets the parameter to a new element id.
SetValueString
Set the parameter value according to the input string.
See Also
Parameter Class
Autodesk.Revit.DB Namespace