Revit 2018 API
Material Properties
The Material type exposes the following members.
Properties
Name | Description
AppearanceAssetId
 The ElementId of the AppearanceAssetElement.
Color
 The color of the material.
CutPatternColor
 The color of the material cut pattern.
CutPatternId
 The id of the FillPatternElement associated to cut views of faces with this material.
MaterialCategory
 The name of the material category, e.g. 'Wood'
MaterialClass
 The name of the general material type, e.g. 'Wood.'
Shininess
 The shininess of the material.
Smoothness
 The smoothness of the material.
StructuralAssetId
 The ElementId of the structural PropertySetElement.
SurfacePatternColor
 The color of the material surface pattern.
SurfacePatternId
 The id of the FillPatternElement associated to normal views of faces with this material.
ThermalAssetId
 The ElementId of the thermal PropertySetElement.
Transparency
 The transparency of the material.
UseRenderAppearanceForShading
 True to use the render appearance settings for shaded view appearance; false to use the material's color and transparency value for shaded view appearance.
See Also
Material Class
Autodesk.Revit.DB Namespace