Revit 2018 API
SolidOptions Members
The SolidOptions type exposes the following members.
Constructors
Name | Description
SolidOptions
 Creates a new SolidOptions class with material and graphics style settings.
Methods
Name | Description
Dispose
Releases all resources used by the SolidOptions
Properties
Name | Description
GraphicsStyleId
 Defines the graphics style id for the Solid.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MaterialId
 Defines the material id for the Solid.
See Also
SolidOptions Class
Autodesk.Revit.DB Namespace