Revit 2018 API
AssetPropertyString Members
The AssetPropertyString type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Value
 value of the property
See Also
AssetPropertyString Class
Autodesk.Revit.DB.Visual Namespace