Revit 2018 API
DuctSizeSettings Properties
The DuctSizeSettings type exposes the following members.
Properties
Name | Description
Item
See Also
DuctSizeSettings Class
Autodesk.Revit.DB.Mechanical Namespace