Revit 2018 API
StructuralElementDefinitionData Members
The StructuralElementDefinitionData type exposes the following members.
Constructors
Name | Description
StructuralElementDefinitionData
 Creates empty StructuralElementDefinitionData object.
Methods
Name | Description
Dispose
Releases all resources used by the StructuralElementDefinitionData
Properties
Name | Description
CenterCurve
 The curve lying in the geometrical center of the element.
IsMirrored
 States if the structural section of the element is mirrored.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Normal
 The local Z direction of the element section in the start point of the curve.
Section
 Structural section of the element.
See Also
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace