Revit 2018 API
FabricationConfiguration Members
The FabricationConfiguration type exposes the following members.
Methods
Name | Description
AncillaryExists
 Checks to see if the specified ancillary exists.
CanBeSwapped
 Checks if the fabrication configuration can be swapped.
CustomDataExists
 Checks to see if the specified custom data exists.
DamperExists
 Checks to see if the specified damper exists.
GetAllDampers
 Gets all damper identifiers in the fabrication configuration.
GetAllFabricationConnectorDefinitions
 Gets fabrication connector identifiers from the fabrication configuration, filtered by shape and domain.
GetAllInsulationSpecifications
 Gets all insulation specification identifiers in the fabrication configuration.
GetAllLoadedServices
 Returns all the loaded fabrication services.
GetAllMaterials
 Gets all material identifiers in the fabrication configuration.
GetAllPartCustomData
 Gets all possible fabrication part custom data identifiers.
GetAllPartStatuses
 Gets all possible fabrication part status identifiers.
GetAllServices
 Returns all fabrication services in the fabrication configuration.
GetAllSpecifications
 Gets all specification identifiers in the fabrication configuration.
GetAllUsedServices
 Returns all the used fabrication services. A service is used if any fabrication part in the service is created by user.
GetAncillaries
 Gets fabrication ancillaries of the specified type.
GetAncillaryGroup
 Gets the fabrication ancillary group of the specified fabrication ancillary identifier.
GetAncillaryGroupName
 Gets the fabrication ancillary group and name for the specified fabrication ancillary identifier.
GetAncillaryName
 Gets the fabrication ancillary name for the specified fabrication ancillary identifier.
GetDamperName
 Gets the damper name from its identifier.
GetFabricationConfiguration
 Gets the fabrication configuration element in the document.
GetFabricationConfigurationInfo
 Gets the information about the fabrication configuration of the project.
GetFabricationConnectorDomain
 Gets the fabrication connector domain from its identifier.
GetFabricationConnectorGroup
 Gets the fabrication connector group from its identifier.
GetFabricationConnectorName
 Gets the fabrication connector name from its identifier.
GetFabricationConnectorShape
 Gets the fabrication connector shape from its identifier.
GetInsulationSpecificationAbbreviation
 Gets insulation specification abbreviation.
GetInsulationSpecificationGroup
 Gets the insulation specification group from its identifier.
GetInsulationSpecificationName
 Gets the insulation specification name from its identifier.
GetMaterialAbbreviation
 Gets the abreviation of the material or the insulation or the double wall material.
GetMaterialGroup
 Gets material group from its identifier.
GetMaterialName
 Gets material name from its identifier.
GetMaterialThickness
 Gets material thickness from its material/gauge identifiers.
GetPartCustomDataName
 Gets the custom data name from its identifier.
GetPartCustomDataType
 Gets the custom data type from its identifier. See FabricationCustomDataType enumerator.
GetPartStatusDescription
 Gets the status description from its identifier.
GetProfile
 Return the profile of the loaded fabrication configuration. Return empty string for global profile.
GetService
 Get the service based on the service identifier from the fabrication configuration in the current document.
GetServiceTypeName
 Gets the service type name.
GetSpecificationAbbreviation
 Gets specification abreviation.
GetSpecificationGroup
 Gets the specification group from its identifier.
GetSpecificationName
 Gets the specification name from its identifier.
HasValidConfiguration
 Checks whether a valid fabrication configuration has been set for the project.
IsAncillaryKit
 Gets whether the specified fabrication ancillary identifier is an ancillary kit or not.
LoadServices
 Loads the specified fabrication services into the project.
LocateFabricationConnector
 Gets the fabrication connector identifiers by group and name, filtered by shape and domain.
LocateInsulationSpecification
 Gets the insulation specification by group and name.
LocateMaterial
 Gets material by group and name.
LocateSpecification
 Gets the specification identifier by group and name.
ReloadConfiguration
 Reloads the fabrication configuration from its source fabrication configuration.
SetConfiguration(FabricationConfigurationInfo)
 Set the fabrication configuration with global profile.
SetConfiguration(FabricationConfigurationInfo, String)
 Set the fabrication configuration with specific profile.
UnloadServices
 Unload the specified fabrication services from the project.
Properties
Name | Description
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace