Revit 2018 API
ProjectLocation Properties
The ProjectLocation type exposes the following members.
Properties
Name | Description
ProjectPosition |  Obsolete.
Gets or sets the coordinates of a point in the project location coordinate system.
SiteLocation |  Obsolete.
The site location to which this project location refers.
See Also
ProjectLocation Class
Autodesk.Revit.DB Namespace