Revit 2018 API
DockablePaneProviderData Methods
The DockablePaneProviderData type exposes the following members.
Methods
Name | Description
GetFrameworkElement
See Also
DockablePaneProviderData Class
Autodesk.Revit.UI Namespace