Revit 2018 API
RebarCoupler Members
The RebarCoupler type exposes the following members.
Methods
Name | Description
CouplerLinkTwoBars
 returns true if the coupler sits on two rebar and false otherwise
Create
 Creates a new instance of a Rebar Coupler element within the project.
GetCoupledReinforcementData
 gets the reinforcement data. The returned list will have size = 2. If coupler stays on only one bar one element in this list will be null.
GetCouplerPositionTransform
 Return a transform representing the relative position of the coupler at index couplerPositionIndex in the set.
GetCouplerQuantity
 Identifies the number of couplers in a set.
GetPointsForPlacement
 gets the point (or points in case of rebar set) where the coupler is placed
Properties
Name | Description
CouplerMark
 gets and sets the coupler mark
See Also
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace