Revit 2018 API
ViewDisplayBackground Methods
The ViewDisplayBackground type exposes the following members.
Methods
Name | Description
CreateGradient
 Creates an object that can be passed to DBView::setBackground function to set the background of the Gradient type.
CreateImage
 Creates an object that can be passed to DBView::setBackground function to set the background of the Image type.
CreateSky
 Creates an object that can be passed to DBView::setBackground function to set the background of the SunAndClouds type.
Dispose
See Also
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace