Revit 2018 API
AssetPropertyList Methods
The AssetPropertyList type exposes the following members.
Methods
Name | Description
GetValue
 Gets collection of properties stored in this property list.
See Also
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace