Revit 2018 API
StructuralConnectionHandlerType Methods
The StructuralConnectionHandlerType type exposes the following members.
Methods
Name | Description
Create
 Creates a new StructuralConnectionHandlerType object.
CreateDefaultStructuralConnectionHandlerType
 Creates a new StructuralConnectionHandlerType object with a default name.
GetDefaultConnectionHandlerType
 Gets a default type id for Structural Connection.
IsCustom
 Checks if StructuralConnectionHandlerType is custom.
See Also
StructuralConnectionHandlerType Class
Autodesk.Revit.DB.Structure Namespace