Revit 2018 API
IndexBuffer Methods
The IndexBuffer type exposes the following members.
Methods
Name | Description
Dispose
GetIndexStreamLine
 Gets a stream that can be used to write line segment primitives into the buffer.
GetIndexStreamPoint
 Gets a stream that can be used to write point primitives into the buffer.
GetIndexStreamTriangle
 Gets a stream that can be used to write triangle primitives into the buffer.
GetMappedHandle
 Gets a handle to the buffer's memory that has been mapped. Writing data to the buffer using the handle is an alternative to using stream objects.
IsValid
 Tests whether the buffer is valid for rendering.
Map
 Maps a portion of the buffer into memory, so that indices can be written into it (see Autodesk::Revit::DB::DirectContext3D::VertexStream).
Unmap
 Unmaps the buffer so that it can be used for rendering.
See Also
IndexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace