Revit 2018 API
Rebar Properties
The Rebar type exposes the following members.
Properties
Name | Description
ArrayLength |  Obsolete.
 Identifies the distribution path length of rebar set.
BarsOnNormalSide |  Obsolete.
 Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal.
BaseFinishingTurns |  Obsolete.
 For a spiral, the number of finishing turns at the lower end of the spiral.
DistributionType
 The type of rebar distribution(also known as Rebar Set Type).
Height |  Obsolete.
 For a spiral, the overall height.
IncludeFirstBar
 Identifies if the first bar in rebar set is shown.
IncludeLastBar
 Identifies if the last bar in rebar set is shown.
LayoutRule
 Identifies the layout rule of rebar set.
MaxSpacing
 Identifies the maximum spacing between rebar in rebar set.
MultiplanarDepth |  Obsolete.
 For a multiplanar rebar, the depth of the instance.
Normal |  Obsolete.
 A unit-length vector normal to the plane of the rebar
NumberOfBarPositions
 The number of potential bars in the set.
Pitch |  Obsolete.
 For a spiral, the pitch, or vertical distance traveled in one rotation.
Quantity
 Identifies the number of bars in rebar set.
ReadOnlyParameters
 When set to true, Rebar will report all its parameters as read only. For example, the method Parameter::IsReadOnly() for all Rebar Parameters will return true. When set to false, the return value of Parameter::IsReadOnly() will not be affected.
RebarShapeId |  Obsolete.
 The RebarShape element that defines the shape of the rebar.
ScheduleMark
 The Schedule Mark parameter. On creation, the Schedule Mark is set to a value that is unique to the host, but it can be set to any value.
TopFinishingTurns |  Obsolete.
 For a spiral, the number of finishing turns at the upper end of the spiral.
TotalLength
 The length of an individual bar multiplied by Quantity.
Volume
 The volume of an individual bar multiplied by Quantity.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace