Revit 2018 API
DirectShapeType Methods
The DirectShapeType type exposes the following members.
Methods
Name | Description
AppendShape(IList<GeometryObject>)
 Appends the collection of GeometryObjects into the model shape representation stored in this DirectShape.
AppendShape(ShapeBuilder)
 Append shape built by the supplied ShapeBuilderObject to shape representation stored in this DirectShapeType. The data stored in the supplied ShapeBuilder object will be cleared.
AppendShape(IList<GeometryObject>, DirectShapeTargetViewType)
 Appends the collection of GeometryObjects into the model or view specific shape representation stored in this DirectShapeType. Passing DirectShapeTargetViewType.Default as view type will cause the model shape to be updated.
Create
 Creates a DirectShapeType element.
IsValidShape(IList<GeometryObject>)
 Validates shape to be stored in a DirectShapeType.
IsValidShape(IList<GeometryObject>, DirectShapeTargetViewType)
 Validates view-specific shape to be stored in a DirectShapeType. Expects a non-default view type.
SetShape(IList<GeometryObject>)
 Builds the type shape from the supplied collection of GeometryObjects. The objects are copied. If the new shape is identical to the old one, the old shape will be kept.
SetShape(ShapeBuilder)
 Sets the shape of this object to the one accumulated in the supplied Builder object. If the new shape is identical to the old one, the old shape will be kept.
See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace