Revit 2018 API
LabelUtils Methods
The LabelUtils type exposes the following members.
Methods
Name | Description
Dispose
GetLabelFor(BuiltInParameter)
 Gets the user-visible name for a BuiltInParameter.
GetLabelFor(BuiltInParameterGroup)
 Gets the user-visible name for a BuiltInParameterGroup.
GetLabelFor(DisplayUnitType)
 Gets the user-visible name for a DisplayUnitType.
GetLabelFor(ParameterType)
 Gets the user-visible name for a ParameterType.
GetLabelFor(UnitSymbolType)
 Gets the user-visible name for a UnitSymbolType.
GetLabelFor(UnitType)
 Gets the user-visible name for a UnitType.
GetLabelFor(DuctLossMethodType, Document)
 Gets the user-visible name for a DuctLossMethodType.
GetLabelFor(gbXMLBuildingType, Document)
 Gets the user-visible name for a gbXMLBuildingType.
GetLabelFor(PipeFlowState, Document)
 Gets the user-visible name for a PipeFlowState.
GetLabelFor(PipeLossMethodType, Document)
 Gets the user-visible name for a PipeLossMethodType.
GetStructuralSectionShapeName
 Gets the user-visible name for a StructuralSectionShape.
See Also
LabelUtils Class
Autodesk.Revit.DB Namespace