Revit 2018 API
AssetPropertyDouble Members
The AssetPropertyDouble type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Value
 The value of the property.
See Also
AssetPropertyDouble Class
Autodesk.Revit.DB.Visual Namespace