Revit 2018 API
GBXMLExportOptions Members
The GBXMLExportOptions type exposes the following members.
Constructors
Name | Description
GBXMLExportOptions
 Constructs a new instance of the options used to export a model in gbXML (green-building) format.
Methods
Name | Description
Dispose
Releases all resources used by the GBXMLExportOptions
Properties
Name | Description
ExportEnergyModelType
 The energy model type from which gbXML will be exported.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
GBXMLExportOptions Class
Autodesk.Revit.DB Namespace