Revit 2018 API
StructuralConnectionHandler Members
The StructuralConnectionHandler type exposes the following members.
Methods
Name | Description
AddElementIds
 Adds element ids to the connection. All element ids in an array should be of applicable category.
Create(Document, IList<ElementId>)
 Creates a new instance of a Structural Connection Handler, which defines the connection between given elements. Elements should be of the following structural categories: framings, columns, walls, floors or foundations. The first of given elements is set as the primary one.
Create(Document, IList<ElementId>, ElementId)
 Creates a new instance of a Structural Connection Handler, which defines the connection between given elements. Elements should be of the following structural categories: framings, columns, walls, floors or foundations. The first of given elements is set as primary one.
GetConnectedElementIds
 Retrieves list of element ids of connected elements.
GetOrigin
 Retrieves origin point of Structural Connection Handler element.
IsDetailed
 Checks if Structural Connection Handler has the detailed connection style.
RemoveElementIds
 Removes element ids from the connection. All element ids in an array should belong to the connection.
SetDefaultPrimaryElement
 Sets primary element in connection according to structural categories, element materials and geometries. The steel element is set rather than an element of other material. The priorities of the elements are set according structural categories in following order: columns, framings, walls, foundations, floors. In case of several Structural Framing elements order is determined by cutting - the cutting element is set as the primary one rather than element being cut.
Properties
Name | Description
ApprovalTypeId
 Retrieves or changes approval type of the Structural Connection Handler.
CodeCheckingStatus
 Code checking status of the structural connection.
SingleElementEndIndex
 Element end index for single element connections (0: start, 1: end).
See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace