Revit 2018 API
ConfigurationReloadInfo Members
The ConfigurationReloadInfo type exposes the following members.
Constructors
Name | Description
ConfigurationReloadInfo
 Constructor.
Methods
Name | Description
Dispose
Releases all resources used by the ConfigurationReloadInfo
GetConnectivityValidation
 Returns information about the post-reload connectivity validation.
Properties
Name | Description
Disconnects
 The number of disconnections caused by the reload.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ProfileNotAvailable
 The current profile is not available in the disk configuration.
See Also
ConfigurationReloadInfo Class
Autodesk.Revit.DB Namespace