Revit 2018 API
DuctSettings Properties
The DuctSettings type exposes the following members.
Properties
Name | Description
AirDensity
 The air density.
AirViscosity
 The air dynamic viscosity.
Centerline
 The abbreviation of the Centerline (=) string.
ConnectorSeparator
 The duct connector separator string.
FittingAngleUsage
 Determine how to use fitting angle during duct layout or modifying layout.
FittingAnnotationSize
 The value of fitting annotation size.
FlatOnBottom
 The abbreviation of the Flat On Bottom (FOB) string.
FlatOnTop
 The abbreviation of the Flat On Top (FOT) string.
OvalDuctSizeSeparator
 The oval duct size separator string.
OvalDuctSizeSuffix
 The oval duct size suffix string.
RectangularDuctSizeSeparator
 The rectangular duct size separator string.
RectangularDuctSizeSuffix
 The rectangular duct size suffix string.
RiseDropAnnotationSize
 The rise drop annotation size.
RoundDuctSizePrefix
 The round duct size prefix string.
RoundDuctSizeSuffix
 The round duct size suffix string.
SetDown
 The abbreviation of the Set Down (SD) string.
SetUp
 The abbreviation of the Set Up (SU) string.
UseAnnotationScaleForSingleLineFittings
 Indicates whether use annotation scale for single line fittings or not.
See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace