Revit 2018 API
ExternalDefinitionCreationOptions Members
The ExternalDefinitionCreationOptions type exposes the following members.
Constructors
Name | Description
ExternalDefinitionCreationOptions
 Constructs the options using a specified name and type.
Methods
Name | Description
Dispose
Releases all resources used by the ExternalDefinitionCreationOptions
Properties
Name | Description
Description
 The description of the parameter definition to be created. The description will be used as tooltip in the Revit UI including in the properties palette. The default is an empty string.
GUID
 The GUID to use for this parameter definition. If not explicitly set, a random GUID is used.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The name of the parameter definition to be created.
Type
 The type of the parameter definition to be created.
UserModifiable
 This property indicates whether this parameter can be modified by UI user or not. True if the parameter will be modifiable by the user in the user interface, false if the parameter will display as read-only. The default is true.
Visible
 True if the parameter is visible to the user, false if it is hidden and accessible only via the API. The default is true.
See Also
ExternalDefinitionCreationOptions Class
Autodesk.Revit.DB Namespace