Revit 2018 API
AssetPropertyInteger Members
The AssetPropertyInteger type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Value
 The value of the property.
See Also
AssetPropertyInteger Class
Autodesk.Revit.DB.Visual Namespace