Revit 2018 API
MEPAnalyticalConnectionType Methods
The MEPAnalyticalConnectionType type exposes the following members.
Methods
Name | Description
Create
 Creates an analytical connection type element.
FindTypeByName
 Finds the analytical connection type by its name.
GetAllTypes
 Gets all the analytical connection types.
IsNameUnused
 Checks if this is an unused name.
See Also
MEPAnalyticalConnectionType Class
Autodesk.Revit.DB Namespace