Revit 2018 API
IndexStreamPoint Members
The IndexStreamPoint type exposes the following members.
Methods
Name | Description
AddPoint
 Inserts a point into the stream and associated buffer.
AddPoints
 Inserts multiple points into the stream and associated buffer.
Properties
Name | Description
See Also
IndexStreamPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace