Revit 2018 API
AssetPropertyFloat Members
The AssetPropertyFloat type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Value
 The value of the property.
See Also
AssetPropertyFloat Class
Autodesk.Revit.DB.Visual Namespace