Revit 2018 API
CustomExporter Methods
The CustomExporter type exposes the following members.
Methods
Name | Description
Dispose
Export(IList<ElementId>)
 Exports a collection of 3-D views
Export(View3D)
 Exports one 3-D view
IsRenderingSupported
 Checks if 3D view rendering is currently supported in the running instance of Revit.
See Also
CustomExporter Class
Autodesk.Revit.DB Namespace