Revit 2018 API
ProjectLocation Members
The ProjectLocation type exposes the following members.
Methods
Name | Description
Create
 Create an instance of ProjectLocation in the document.
Duplicate
 Generate a copy of this project location with the specified name.
GetProjectPosition
 Gets the coordinates of a point in the ProjectLocation's coordinate system.
GetSiteLocation
 Gets the site location to which this project location refers.
IsProjectLocationNameUnique
 Verifies that there is no existing ProjectLocation with the given name in the document.
SetProjectPosition
 Sets the coordinates of a point in the ProjectLocation's coordinate system.
Properties
Name | Description
ProjectPosition |  Obsolete.
Gets or sets the coordinates of a point in the project location coordinate system.
SiteLocation |  Obsolete.
The site location to which this project location refers.
See Also
ProjectLocation Class
Autodesk.Revit.DB Namespace