Revit 2018 API
Group Properties
The Group type exposes the following members.
Properties
Name | Description
GroupType
Get or set the type of the group.
Location
This property is used to find the physical location of a group within project.
 (Overrides Element.Location.)
See Also
Group Class
Autodesk.Revit.DB Namespace