Revit 2018 API
PipingSystem Members
The PipingSystem type exposes the following members.
Methods
Name | Description
Create(Document, ElementId)
 Creates a new instance of a piping system and adds it to the document.
Create(Document, ElementId, String)
 Creates a new instance of a piping system and adds it to the document.
GetFixtureUnits
 Gets the fixture units of this piping system.
GetFlow
 Gets the flow of this piping system.
GetStaticPressure
 Gets the static pressure of this piping system.
GetVolume
 Gets the volume of this piping system.
IsFlowServerMissing
 Indicates if any flow server which was used in the piping system is not available.
IsPressureDropServerMissing
 Indicates if any pressure drop server which was used in the piping system is not available.
Properties
Name | Description
BaseEquipmentConnector
The connector within base equipment which is used to connect with system.
IsWellConnected
 Indicates if the system is well connected or not.
PipingNetwork
 Pipes and fittings which are contained in this system.
SystemType
The type of this piping system.
See Also
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace