Revit 2018 API
Group Methods
The Group type exposes the following members.
Methods
Name | Description
GetMemberIds
Retrieves all the member ElementIds of the group.
UngroupMembers
Ungroups the group.
See Also
Group Class
Autodesk.Revit.DB Namespace