Revit 2018 API
AssetPropertyDoubleArray4d Properties
The AssetPropertyDoubleArray4d type exposes the following members.
Properties
Name | Description
Value |  Obsolete.
Get the value of the property
See Also
AssetPropertyDoubleArray4d Class
Autodesk.Revit.DB.Visual Namespace