Revit 2018 API
FabricWireItem Methods
The FabricWireItem type exposes the following members.
Methods
Name | Description
Create(Double, Double, ElementId) |  Obsolete.
 Creates a new instance of a single Fabric wire.
Create(Double, Double, ElementId, Double)
 Creates a new instance of a single Fabric wire.
Dispose
See Also
FabricWireItem Class
Autodesk.Revit.DB.Structure Namespace