Revit 2018 API
AssetPropertyDoubleArray3d Properties
The AssetPropertyDoubleArray3d type exposes the following members.
Properties
Name | Description
Value |  Obsolete.
Get the value of the property
See Also
AssetPropertyDoubleArray3d Class
Autodesk.Revit.DB.Visual Namespace