Revit 2018 API
Surface Members
The Surface type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the Surface
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
OrientationMatchesParametricOrientation
 Indicates whether this Surface's orientation is the same as or opposite to its parametric orientation.
See Also
Surface Class
Autodesk.Revit.DB Namespace