Revit 2018 API
GroupType Members
The GroupType type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Groups
Retrieve a set of all the groups that have this type.
See Also
GroupType Class
Autodesk.Revit.DB Namespace