Revit 2018 API
MultiReferenceAnnotation Members
The MultiReferenceAnnotation type exposes the following members.
Methods
Name | Description
AreReferencesValidForLinearDimension
 If the DimensionStyleType is Linear, validates that the references are valid for an aligned multi-reference annotation.
AreReferencesValidForLinearFixedDimension
 If the DimensionStyleType is LinearFixed, validates that the references are valid for an aligned multi-reference annotation.
Create
 Creates a new MultiReferenceAnnotation.
IsLinearFixedDimensionDirectionValid
 If the DimensionStyleType is LinearFixed, this function verifies that the dimension line direction matches either the view's vertical or horizontal direction.
Properties
Name | Description
DimensionId
 The child dimension owned by this multi-reference annotation.
TagId
 The child IndependentTag owned by this multi-reference annotation.
See Also
MultiReferenceAnnotation Class
Autodesk.Revit.DB Namespace