Revit 2018 API
AssetPropertyDoubleArray4d Members
The AssetPropertyDoubleArray4d type exposes the following members.
Methods
Name | Description
GetValueAsDoubles
 Get the value property as doubles.
GetValueAsFloats
 Get the value property as floats.
Properties
Name | Description
Value |  Obsolete.
Get the value of the property
See Also
AssetPropertyDoubleArray4d Class
Autodesk.Revit.DB.Visual Namespace