Revit 2018 API
StructuralConnectionHandlerType Members
The StructuralConnectionHandlerType type exposes the following members.
Methods
Name | Description
Create
 Creates a new StructuralConnectionHandlerType object.
CreateDefaultStructuralConnectionHandlerType
 Creates a new StructuralConnectionHandlerType object with a default name.
GetDefaultConnectionHandlerType
 Gets a default type id for Structural Connection.
IsCustom
 Checks if StructuralConnectionHandlerType is custom.
Properties
Name | Description
ConnectionGuid
 The GUID to use for identifying connection geometry generation algorithm.
See Also
StructuralConnectionHandlerType Class
Autodesk.Revit.DB.Structure Namespace