Revit 2018 API
AssetPropertyDistance Members
The AssetPropertyDistance type exposes the following members.
Methods
Name | Description
Properties
Name | Description
DisplayUnitType
 Unit distance.
Value
 Value of the property.
See Also
AssetPropertyDistance Class
Autodesk.Revit.DB.Visual Namespace