Revit 2018 API
OverrideGraphicSettings Methods
The OverrideGraphicSettings type exposes the following members.
Methods
Name | Description
Dispose
SetCutFillColor
 Sets the cut surface fill color.
SetCutFillPatternId
 Sets the ElementId of the cut surface fill pattern.
SetCutFillPatternVisible
 Sets the visibility of the cut surface fill pattern.
SetCutLineColor
 Sets the cut surface line color.
SetCutLinePatternId
 Sets the ElementId of the cut surface line pattern.
SetCutLineWeight
 Sets the cut surface line weight.
SetDetailLevel
 Sets the detail level.
SetHalftone
 Sets the halftone value.
SetProjectionFillColor
 Sets the projection surface fill color.
SetProjectionFillPatternId
 Sets the projection surface fill pattern.
SetProjectionFillPatternVisible
 Sets the visibility of the projection surface fill pattern.
SetProjectionLineColor
 Sets the projection surface line color.
SetProjectionLinePatternId
 Sets the ElementId of the projection surface line pattern.
SetProjectionLineWeight
 Sets the projection surface line weight.
SetSurfaceTransparency
 Sets the projection surface transparency.
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace