Revit 2018 API
IFCImportOptions Methods
The IFCImportOptions type exposes the following members.
Methods
Name | Description
Dispose
GetConversionData
 Get the data used in the creation of the associated Revit file for an IFC link operation, if it exists.
See Also
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace