Revit 2018 API
AssetPropertyDoubleArray3d Methods
The AssetPropertyDoubleArray3d type exposes the following members.
Methods
Name | Description
GetValueAsDoubles
 Get the value property as doubles.
GetValueAsXYZ
 Get the value property as a vector or point XYZ.
See Also
AssetPropertyDoubleArray3d Class
Autodesk.Revit.DB.Visual Namespace