Revit 2018 API
Reference Methods
The Reference type exposes the following members.
Methods
Name | Description
Contains
ConvertToStableRepresentation
Converts the reference to a stable String representation.
CreateLinkReference
Creates a Reference from a Reference in an RVT Link.
CreateReferenceInLink
Creates a Reference in an RVT Link from a Reference in the RVT host file.
EqualTo
ParseFromStableRepresentation
Converts a stable String representation of a reference to a Reference object.
See Also
Reference Class
Autodesk.Revit.DB Namespace