Revit 2018 API
PipingSystem Methods
The PipingSystem type exposes the following members.
Methods
Name | Description
Create(Document, ElementId)
 Creates a new instance of a piping system and adds it to the document.
Create(Document, ElementId, String)
 Creates a new instance of a piping system and adds it to the document.
GetFixtureUnits
 Gets the fixture units of this piping system.
GetFlow
 Gets the flow of this piping system.
GetStaticPressure
 Gets the static pressure of this piping system.
GetVolume
 Gets the volume of this piping system.
IsFlowServerMissing
 Indicates if any flow server which was used in the piping system is not available.
IsPressureDropServerMissing
 Indicates if any pressure drop server which was used in the piping system is not available.
See Also
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace