Revit 2018 API
DialogBoxShowingEventArgs Properties
The DialogBoxShowingEventArgs type exposes the following members.
Properties
Name | Description
DialogId
See Also
DialogBoxShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace