Revit 2018 API
FilledRegionType Properties
The FilledRegionType type exposes the following members.
Properties
Name | Description
Background
 The background.
Color
 The color of the fill pattern.
FillPatternId
 The fill pattern Id.
LineWeight
 The line weight of the fill pattern.
See Also
FilledRegionType Class
Autodesk.Revit.DB Namespace