Revit 2018 API
SharedParameterElement Methods
The SharedParameterElement type exposes the following members.
Methods
Name | Description
Create
 Creates a new shared parameter element in the document representing the parameter stored in the input ExternalDefinition.
Lookup
 Finds the shared parameter element that corresponds to the given Guid.
See Also
SharedParameterElement Class
Autodesk.Revit.DB Namespace