Revit 2018 API
AssetPropertyEnum Properties
The AssetPropertyEnum type exposes the following members.
Properties
Name | Description
Value
 Value of the property.
See Also
AssetPropertyEnum Class
Autodesk.Revit.DB.Visual Namespace