Revit 2018 API
AssetPropertyEnum Members
The AssetPropertyEnum type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Value
 Value of the property.
See Also
AssetPropertyEnum Class
Autodesk.Revit.DB.Visual Namespace