Revit 2018 API
IndexStreamLine Methods
The IndexStreamLine type exposes the following members.
Methods
Name | Description
AddLine
 Inserts a line segment into the stream and associated buffer.
AddLines
 Inserts multiple line segments into the stream and associated buffer.
See Also
IndexStreamLine Class
Autodesk.Revit.DB.DirectContext3D Namespace