Revit 2018 API
IndexStreamTriangle Methods
The IndexStreamTriangle type exposes the following members.
Methods
Name | Description
AddTriangle
 Inserts a triangle into the stream and associated buffer.
AddTriangles
 Inserts multiple triangles into the stream and associated buffer.
See Also
IndexStreamTriangle Class
Autodesk.Revit.DB.DirectContext3D Namespace