Revit 2018 API
OverrideGraphicSettings Members
The OverrideGraphicSettings type exposes the following members.
Constructors
Name | Description
OverrideGraphicSettings()
 Creates a new instance of an OverrideGraphicSettings object.
OverrideGraphicSettings(OverrideGraphicSettings)
 Creates a new instance of an OverrideGraphicSettings object based on an existing OverrideGraphicSettings object.
Methods
Name | Description
Dispose
Releases all resources used by the OverrideGraphicSettings
SetCutFillColor
 Sets the cut surface fill color.
SetCutFillPatternId
 Sets the ElementId of the cut surface fill pattern.
SetCutFillPatternVisible
 Sets the visibility of the cut surface fill pattern.
SetCutLineColor
 Sets the cut surface line color.
SetCutLinePatternId
 Sets the ElementId of the cut surface line pattern.
SetCutLineWeight
 Sets the cut surface line weight.
SetDetailLevel
 Sets the detail level.
SetHalftone
 Sets the halftone value.
SetProjectionFillColor
 Sets the projection surface fill color.
SetProjectionFillPatternId
 Sets the projection surface fill pattern.
SetProjectionFillPatternVisible
 Sets the visibility of the projection surface fill pattern.
SetProjectionLineColor
 Sets the projection surface line color.
SetProjectionLinePatternId
 Sets the ElementId of the projection surface line pattern.
SetProjectionLineWeight
 Sets the projection surface line weight.
SetSurfaceTransparency
 Sets the projection surface transparency.
Properties
Name | Description
CutFillColor
 Cut surface fill color.
CutFillPatternId
 ElementId of the cut surface fill pattern.
CutLineColor
 Cut surface line color.
CutLinePatternId
 ElementId of the cut surface line pattern.
CutLineWeight
 Cut surface line weight.
DetailLevel
 The Detail Level.
Halftone
 Value of the halftone override.
InvalidPenNumber
 The invalidPenNumber for clearing line wieght overrides.
IsCutFillPatternVisible
 Visibility of the cut surface fill pattern.
IsProjectionFillPatternVisible
 The visibility of the projection surface fill pattern.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ProjectionFillColor
 Projection surface fill color.
ProjectionFillPatternId
 ElementId of the projection surface fill pattern.
ProjectionLineColor
 Projection surface line color.
ProjectionLinePatternId
 Id of the projection surface line pattern.
ProjectionLineWeight
 The projection surface line weight.
Transparency
 Transparency of surfaces.
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace