Revit 2018 API
FilledRegion Properties
The FilledRegion type exposes the following members.
Properties
Name | Description
IsMasking
 Indicates whether the filled region is masking or not.
See Also
FilledRegion Class
Autodesk.Revit.DB Namespace