Revit 2018 API
FabricationPart Methods
The FabricationPart type exposes the following members.
Methods
Name | Description
AddPartCustomData
 Add custom data type to the fabrication part. The new data gets the default value defined by the fabrication configuration.
AdjustEndLength
 Adjusts the length for the specified connector.
AlignPartByConnector
 Align the part by its connector to a point and rotation in free space.
AlignPartByConnectors
 Moves fabrication part by one of its connectors and aligns it to another connector.
AlignPartByConnectorToConnector
 Align a part by its connector to another connector. This will replace the FabricationPart::AlignPartByConnectors method.
AlignPartByInsertionPoint
 Align the part by its insertion point to a point and rotation in free space.
AlignPartByInsertionPointAndCutInToStraight
 Align the part by its insertion point to a point and rotation on a straight. This will automatically size and connect the part being cut into, if possible.
CanAdjustEndLength
 Checks if the end of fabrication part can be adjusted.
CanASlopeBeApplied
 This will test if a slope can be applied to the part and maintain connections with any connected parts.
CanSplitStraight(XYZ)
 Validates if the straight can be split into two at the passed in point.
CanSplitStraight(Document, ElementId, XYZ)
 Validates if the straight can be split into two at the passed in point.
ConnectAndCouple
 Makes a connection between the specified connectors and adds coupling if necessary.
Create(Document, FabricationServiceButton, Int32, ElementId)
 Creates a fabrication part element based on button.
Create(Document, FabricationServiceButton, Double, Double, ElementId)
 Creates a fabrication part element based on button and size.
CreateHanger(Document, FabricationServiceButton, Int32, ElementId)
 Creates a free placed hanger.
CreateHanger(Document, FabricationServiceButton, ElementId, Connector, Double, Boolean)
 Creates a hanger on the fabrication part.
CreateHanger(Document, FabricationServiceButton, Int32, ElementId, Connector, Double, Boolean)
 Creates a hanger on the fabrication part.
GetCalculatedDimensionValue
 Gets the calculated dimension value.
GetDimensionCalculatedOptions
 Gets the calculated options of the fabrication dimension.
GetDimensions
 Gets all fabrication dimensions.
GetDimensionValue
 Gets the value of the fabrication dimension, returns value in Revit internal units.
GetHostedInfo
 Gets the fabrication hosted element information.
GetPartAncillaryUsage
 Gets a list of all ancillary usage information for the part.
GetPartCustomDataInteger
 Get custom data integer value for the specified custom data.
GetPartCustomDataReal
 Get custom data real value for the specified custom data.
GetPartCustomDataText
 Get custom data text for the specified custom data.
GetProductListEntryCount
 Gets the number of product entries for this part.
GetProductListEntryName
 Gets the specified product list entry name.
GetRodInfo
 Gets the fabrication rod information.
GetTransform
 Gets the transformation matrix of the fabrication part element.
HasCustomData
 Check if fabrication part contains custom data already.
HasNoConnections
 Checks to see if all the fabrication part's connectors are open.
IsAHanger
 Checks whether it is a hanger.
IsAStraight
 Checks whether it is a straight part.
IsATap
 Checks if it is any sort of tap.
IsDimensionCalculated
 Checks if the fabrication dimension is calculated.
IsProductList
 Gets whether or not the fabrication part is a product list.
IsProductListEntryCompatibleSize
 Checks to see if this part can be changed to the specified product entry without altering any connected dimensions.
IsSameAs
 Compare this fabrication part with the part passed and checks the pattern dimensions and options. A list of fields that can be ignored in the comparison check can be specified.
IsStraightSegment
 Validates if the part is a straight.
OptimizeLengths
 Optimizes the length fabrication straight parts.
PlaceAsTap
 Places the part by its connector to a specific position on the straight part at the specified distance from the host part connector.
PlaceFittingAsCutIn
 Places the fitting on the straight part by cut in, use the fitting's focal point as the insertion position.
RemovePartCustomData
 Remove custom data from the fabrication part.
Reposition
 Repositions the fabrication straight part to another end of the run.
RotateConnectedPartByConnector
 Rotates a connected fabrication part around the axis of the specified connector.
RotateConnectedTap
 Rotates a connected fabrication tap by the specified angles about the primary and secondary axis.
SetCalculatedDimensionValue
 Sets the calculated dimension value.
SetDimensionValue
 Sets the fabrication dimension value. The value is in Revit internal units.
SetPartCustomDataInteger
 Set the custom data integer value for the specified custom data.
SetPartCustomDataReal
 Set the custom data real value for the specified custom data.
SetPartCustomDataText
 Set the custom data real value for the specified custom data.
SetPositionByEnd
 Positions the connector of the fabrication part element by the passed point.
SplitStraight(XYZ)
 Splits the straight into two at the passed in point.
SplitStraight(Document, ElementId, XYZ)
 Splits the straight into two at the passed in point.
StretchAndFit
 Stretch the fabrication part from the specified connector and fit to the target routing end.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace