Revit 2018 API
MultiReferenceAnnotationOptions Methods
The MultiReferenceAnnotationOptions type exposes the following members.
Methods
Name | Description
Dispose
ElementsMatchReferenceCategory
 Verifies that all of the elements match the reference category required by the MultiReferenceAnnotationType.
GetElementsToDimension
 Gets the elements which the dimension will witness.
IsAllowedDimensionStyleType
 Only Linear and LinearFixed dimension style types are allowed for new MultiReferenceAnnotations.
SetElementsToDimension
 Sets the elements which the dimension will witness.
See Also
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace