Revit 2018 API
VertexStreamPositionNormal Members
The VertexStreamPositionNormal type exposes the following members.
Methods
Name | Description
AddVertex
 Inserts a vertex into the stream and associated buffer.
AddVertices
 Inserts vertices into the stream and associated buffer.
Properties
Name | Description
See Also
VertexStreamPositionNormal Class
Autodesk.Revit.DB.DirectContext3D Namespace