Revit 2018 API
ExternalDefinition Members
The ExternalDefinition type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ExternalDefinition
Properties
Name | Description
Description
 The description of the parameter. The description will be used as tooltip in the Revit UI including in the properties palette.
GUID
Returns the GUID associated with the shared parameter definition.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
The user visible name for the parameter.
 (Overrides Definition.Name.)
OwnerGroup
 Returns or change the group ID of the external parameter definition.
ParameterGroup
 Returns the group ID of the parameter definition.
 (Overrides Definition.ParameterGroup.)
ParameterType
Returns the user visible interpretation of the parameter data.
 (Overrides Definition.ParameterType.)
UserModifiable
 Indicates whether the parameter can be modified by the user interface.
Visible
Indicates if the parameter is visible in the Autodesk Revit user interface.
See Also
ExternalDefinition Class
Autodesk.Revit.DB Namespace