Revit 2018 API
RebarConstraint Methods
The RebarConstraint type exposes the following members.
Methods
Name | Description
Create
 This method creates a constraint for a given Rebar Constrained Handle Tag. Will throw exception if used for Shape Driven Rebar.
Dispose
GetConstraintType
 Returns the RebarConstraintType of a RebarConstraint.
GetCustomHandleTag
 Returns the handle tag of the RebarConstrainedHandle. This is valid only for Free Form Rebar.
GetDistanceToTargetCover
 Returns the distance from the RebarConstrainedHandle to the target Host Cover Element surface. The RebarConstraintType of the RebarConstraint must be 'ToCover.'
GetDistanceToTargetHostFace
 Returns the distance from the RebarConstrainedHandle to the target Host Element surface. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace.'
GetRebarConstraintTargetHostFaceType()
 Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.' Will throw exception if it's a multi target constraint.
GetRebarConstraintTargetHostFaceType(Int32)
 Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.'
GetTargetCoverType
 Returns the RebarCoverType for the face specified by targetIndex. Returns null if no RebarHostData is present for target element.
GetTargetElement()
 Gets the Element object (either Host or Rebar) which provides the constraint. Will throw exception if it's a multi target constraint.
GetTargetElement(Int32)
 Gets the Element object (either Host or Rebar) which provides the constraint. Will return the Element which contains the face at targetIndex.
GetTargetHostFaceAndTransform
 Returns the face to which the RebarConstraint is attached associated to the given target index. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.'
GetTargetHostFaceReference()
 Returns a reference to the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.' Will throw exception if it's a multi target constraint.
GetTargetHostFaceReference(Int32)
 Returns a reference that corresponds to the face to which the RebarConstraint is attached specified by the targetIndex. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.'
GetTargetRebarAngleOnBarOrHookBend
 Returns the angular increment along a bar or hook bend to which the RebarConstraint is attached.
GetTargetRebarBendNumber
 Returns the number of the bend on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'BarBend.' Rebar must be Shape Driven Rebar element.
GetTargetRebarConstraintType
 Returns the TargetRebarConstraintType of the handle on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar.' Rebar must be Shape Driven Rebar element.
GetTargetRebarEdgeNumber
 Returns the number of the edge on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'Edge.' Rebar must be Shape Driven Rebar element.
GetTargetRebarHookBarEnd
 Returns 0 or 1 to indicate which end hook on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'HookBend.' Rebar must be Shape Driven Rebar element.
HasAnEdgeNumber
 Checks if the getTargetRebarEdgeNumber method can be called for the RebarConstraint.
IsEqual
 Returns true if the specified RebarConstraint is the same as 'this.' The method can be used to determine which of the RebarConstraint candidates offered by the RebarConstraintsManager is currently active.
IsFixedDistanceToHostFace
 Returns true if the RebarConstraintType of the RebarConstraint is 'FixedDistanceToHostFace.'
IsToCover
 Returns true if the RebarConstraintType of the RebarConstraint is 'ToCover.'
IsToHostFaceOrCover
 Returns true if the RebarConstraintType of the RebarConstraint is either 'FixedDistanceToHostFace' or 'ToCover.'
IsToOtherRebar
 Returns true if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar.'
IsValid
 Checks that the RebarConstraint still has access to valid Rebar constraint data and that its RebarConstraintsManager is still valid.
ReplaceReferenceTargets
 Replaces the current set of references, the type of constraint and the offset value, with the newly provided ones. Will throw exception if this is a constraint for Shape Driven Rebar.
SetDistanceToTargetCover
 Sets the distance from the RebarConstrainedHandle to the target Host Cover Element surface. The RebarConstraintType of the RebarConstraint must be 'ToCover.'
SetDistanceToTargetHostFace
 Sets the distance from the RebarConstrainedHandle to the target Host Element surface. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace.'
TargetIsBarBend
 Returns true if the RebarTargetConstraintType of the RebarConstraint is 'BarBend'.
TargetIsHookBend
 Returns true if the RebarTargetConstraintType of the RebarConstraint is 'HookBend'.
TargetRebarConstraintTypeIsEdge
 Returns true if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar,' and the RebarConstraint is attached to an edge of the other Rebar Element.
See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace