Revit 2018 API
AssetProperties Members
The AssetProperties type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Item[Int32]
Item[String]
Size
Gets the number of the AssetProperty(s) in the object.
See Also
AssetProperties Class
Autodesk.Revit.DB.Visual Namespace