Revit 2018 API
Category Members
The Category type exposes the following members.
Methods
Name | Description
GetCategory(Document, BuiltInCategory)
Retrieves a category object corresponding to a BuiltInCategory id.
GetCategory(Document, ElementId)
 Retrieves a category object corresponding to the category id.
GetGraphicsStyle
Gets the graphics style associated with this category for the given graphics style type.
GetHashCode |  (Overrides Object.GetHashCode().)
GetLinePatternId
Gets the line pattern id associated with this category for the given graphics style type.
GetLineWeight
Retrieves the line weight assigned to the category for the given graphics style type.
SetLinePatternId
Sets the line pattern id associated with this category for the given graphics style type.
SetLineWeight
Sets the line weight for the given graphics style type.
Properties
Name | Description
AllowsBoundParameters
 To check if the category can have project parameters.
AllowsVisibilityControl
Whether the visibility can be controlled by the user for this category in this view.
CanAddSubcategory
Indicates if subcategories can be assigned to the category.
CategoryType
 Gets the category type of this category.
HasMaterialQuantities
 Identifies if elements of the category are able to report what materials they contain in what quantities.
Id
 Returns the category id associated with the category object.
IsCuttable
Indicates if the category is cuttable or not.
IsTagCategory
 Identifies if the category is associated with a type of tag for a different category.
LineColor
The color of lines shown for elements of this category.
Material
 Retrieves or changes the material of the category.
Name
The category name.
Parent
Returns the parent category of this category.
SubCategories
Returns a map containing all of the subcategories of this category.
Visible
 Retrieves or changes the visibility of the category in the active view.
See Also
Category Class
Autodesk.Revit.DB Namespace