Revit 2018 API
FilterRule Methods
The FilterRule type exposes the following members.
Methods
Name | Description
Dispose
ElementPasses
 Derived classes override this method to implement the test that determines whether the given element passes this rule or not.
See Also
FilterRule Class
Autodesk.Revit.DB Namespace