Revit 2018 API
ImageType Members
The ImageType type exposes the following members.
Methods
Name | Description
Create
 Creates a new ImageType element and loads the image into it.
GetImage
Get the bitmap image stored in the image symbol.
IsLoadedFromFile
 Checks whether the image is loaded from a file. Revit may generate some images internally, such as the images created by "Save to Project as Image".
Reload
 Reloads the image from its origin file.
ReloadFrom
 Reloads the image from new image file.
Properties
Name | Description
Path
 The original image file path used if the image is loaded from a disk file, or empty if the image is generated by Revit internally, such as the images created by "Save to Project as Image".
See Also
ImageType Class
Autodesk.Revit.DB Namespace