Revit 2018 API
StructuralConnectionHandler Properties
The StructuralConnectionHandler type exposes the following members.
Properties
Name | Description
ApprovalTypeId
 Retrieves or changes approval type of the Structural Connection Handler.
CodeCheckingStatus
 Code checking status of the structural connection.
SingleElementEndIndex
 Element end index for single element connections (0: start, 1: end).
See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace