Revit 2018 API
ElementMulticlassFilter Members
The ElementMulticlassFilter type exposes the following members.
Constructors
Name | Description
ElementMulticlassFilter(IList<Type>)
 Constructs a filter using multiple types
ElementMulticlassFilter(IList<Type>, Boolean)
 Constructs a filter using multiple types
Methods
Name | Description
Properties
Name | Description
See Also
ElementMulticlassFilter Class
Autodesk.Revit.DB Namespace