Revit 2018 API
Rebar Methods
The Rebar type exposes the following members.
Methods
Name | Description
CanApplyPresentationMode
 Checks if a presentation mode can be applied for this rebar in the given view.
CanSuppressFirstOrLastBar
 Checks if the first or last bar in rebar set can be hidden in the given view.
CanUseHookType
 Checks if the specified RebarHookType id is of a valid RebarHookType for the Rebar's RebarBarType
ClearPresentationMode
 Sets the presentation mode for this rebar set to the default (either for a single view, or for all views).
ComputeDrivingCurves |  Obsolete.
 Compute the driving curves.
ConstraintsCanBeEdited
For ShapeDriven Rebar: returns true, if the Rebar element's external constraints are available for editing using the RebarConstraintsManager class. Examples of where this method would return false are: Rebar in Groups (which do not have constraints), or legacy, sketch-based Rebar elements created before the introduction of RebarShape families in version 2009.
For FreeForm rebar: constraints can be edited if there is a valid external server Guid assigned to that Rebar
ContainsValidArcRadiiForStyleAndBarType
 Checks that all arcs in the chain of curves have radii that are not less than minimum bend radius for bar type and style
CreateFreeForm(Document, Guid, RebarBarType, Element)
 Creates a free form rebar that can have constraints.
CreateFreeForm(Document, RebarBarType, Element, IList<CurveLoop>, RebarFreeFormValidationResult)
 Creates a free form rebar that will be unconstrained. Constraints can't be added later to this rebar.
CreateFreeForm(Document, RebarBarType, Element, IList<IList<Curve>>, RebarFreeFormValidationResult)
 Creates a free form rebar that will be unconstrained. Constraints can't be added later to this rebar.
CreateFromCurves
 Creates a new instance of a shape driven Rebar element within the project.
CreateFromCurvesAndShape
 Creates a new instance of a shape driven Rebar element within the project. The instance will have the default shape parameters from the RebarShape. If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to true, then both the curves and hooks must match the RebarShape definition. Otherwise, the hooks can be different than the defaults specified in the RebarShape
CreateFromRebarShape
 Creates a new shape driven Rebar, as an instance of a RebarShape. The instance will have the default shape parameters from the RebarShape, and its location is based on the bounding box of the shape in the shape definition. Hooks are removed from the shape before computing its bounding box. If appropriate hooks can be found in the document, they will be assigned arbitrarily.
DoesBarExistAtPosition
 Checks whether a bar exists at the specified position.
FindMatchingPredefinedPresentationMode
 Determines if there is a matching RebarPresentationMode for the current set of selected hidden and unhidden bars assigned to the given view.
GetBarPositionTransform |  Obsolete.
 Return a transform representing the relative position of any individual bar in the set.
GetBendData
 Gets the RebarBendData, containing bar and hook information, of the instance.
GetCenterlineCurves
 A chain of curves representing the centerline of the rebar.
GetCouplerId
 Get the id of the Rebar Coupler that is applied to the rebar at the specified end.
GetDistributionPath |  Obsolete.
 The distribution path of a rebar set.
GetEndTreatmentTypeId
 Get the id of the EndTreatmentType to be applied to the rebar.
GetFreeFormAccessor
 Returns an interface providing access to free-form properties and methods for this Rebar element.
GetFullGeometryForView
 Generates full geometry for the Rebar for a specific view.
GetHookOrientation
 Returns the orientation of the hook plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
GetHookTypeId
 Get the id of the RebarHookType to be applied to the rebar.
GetHostId
 The element that contains the rebar.
GetParameterValueAtIndex
 Get the parameter value for a bar at the specified index. The parameter Id. The bar index in the rebar distribution. Accepts only values between 0 and NumberOfBarPositions-1. The ParameterValue for given parameterId and barPositionIndex. Throws exception if barPositionIndex is outside boundaries.
GetPresentationMode
 Gets the presentation mode for this rebar set when displayed in the given view.
GetRebarConstraintsManager
 Returns an object for managing the external constraints on the Rebar element
GetReinforcementRoundingManager
 Returns an object for managing reinforcement rounding override settings.
GetShapeDrivenAccessor
 Returns an interface providing access to shape-driven properties and methods for this Rebar element.
GetShapeId
 Returns the id of the RebarShape element that defines the shape of the rebar.
HasPresentationOverrides
 Identifies if this Rebar has overridden default presentation settings for the given view.
HookAngleMatchesRebarShapeDefinition
 Checks that the hook angle of the specified RebarHookType matches the hook angle used in the Rebar's RebarShape at the specified end of the bar.
IsBarHidden
 Identifies if a given bar in this rebar set is hidden in this view.
IsRebarFreeForm
 Returns true if the rebar is free form and false if shape driven.
IsRebarInSection
 Identifies if this Rebar is shown as a cross-section in the given view.
IsRebarShapeDriven
 Returns true if the rebar is shape driven and false if free form.
IsSolidInView
 Checks if this rebar element is shown solidly in a 3D view.
IsUnobscuredInView
 Checks if this rebar element is shown unobscured in a view.
RebarShapeMatchesCurvesAndHooks
 Checks if rebarShape matches curves and hooks. If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false, then this method will only check the curves argument, and will ignore the hook information.
ScaleToBox |  Obsolete.
 Move and resize the bar to fit within a specified box. The arguments are interpreted as an arbitrary rectangle in 3D with vertices: origin, origin+xVec, origin+xVec+yVec, origin+yVec. The algorithm then proceeds as follows. First the bar is given the default values of the shape parameters from the shape definition. Then, if it is possible to do so without violating the shape definition, the parameter values are scaled so that the width and height of the shape (including bar thickness) match the lengths of xVec and yVec. If there is no way to do this within the shape definition due to overconstraining, a compromise is attempted, such as scaling the whole shape until either the width or the height is correct. Finally the shape is rotated to match the coordinate system of the box. The algorithm is the same one used in one-click placement.
ScaleToBoxFor3D |  Obsolete.
 Move and resize a spiral or multiplanar instance to fit within a specified box. The arguments are interpreted as an arbitrary rectangle in 3D with vertices: origin, origin+xVec, origin+xVec+yVec, origin+yVec. One end of the rebar shape is inscribed in this rectangle following the procedure described for the ScaleToBox method. The other end is placed in the parallel plane at distance (center-to-center) given by the height argument, in the direction of (xVec x yVec). Note that spiral shapes interpret the input arguments using a different convention than multiplanar shapes. For spiral shapes, the spiral start will be placed in the rectangle defined by origin, xVec, yVec, and the end of the spiral will be placed in the parallel plane. For multiplanar shapes, the rebar is placed with its primary shape definition located in the parallel plane defined by the height argument, and its connector segments extending in the direction opposite (xVec x yVec). This method replaces ScaleToBoxForSpiral() from prior releases.
SetBarHiddenStatus
 Sets the bar in this rebar set to be hidden or unhidden in the given view.
SetHookOrientation
 Defines the orientation of the hook plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
SetHookTypeId
 Set the id of the RebarHookType to be applied to the rebar.
SetHostId
 The element that contains the rebar.
SetLayoutAsFixedNumber |  Obsolete.
 Sets the Layout Rule property of rebar set to FixedNumber.
SetLayoutAsMaximumSpacing |  Obsolete.
 Sets the Layout Rule property of rebar set to MaximumSpacing
SetLayoutAsMinimumClearSpacing |  Obsolete.
 Sets the Layout Rule property of rebar set to MinimumClearSpacing
SetLayoutAsNumberWithSpacing |  Obsolete.
 Sets the Layout Rule property of rebar set to NumberWithSpacing
SetLayoutAsSingle |  Obsolete.
 Sets the Layout Rule property of rebar set to Single.
SetPresentationMode
 Sets the presentation mode for this rebar set when displayed in the given view.
SetSolidInView
 Sets this rebar element to be shown solidly in a 3D view.
SetUnobscuredInView
 Sets this rebar element to be shown unobscured in a view.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace