Revit 2018 API
ImageType Properties
The ImageType type exposes the following members.
Properties
Name | Description
Path
 The original image file path used if the image is loaded from a disk file, or empty if the image is generated by Revit internally, such as the images created by "Save to Project as Image".
See Also
ImageType Class
Autodesk.Revit.DB Namespace