Revit 2018 API
ParameterFilterElement Members
The ParameterFilterElement type exposes the following members.
Methods
Name | Description
AllRuleParametersApplicable(IList<FilterRule>)
 Checks that the parameters of the given rules are valid for this filter's categories.
AllRuleParametersApplicable(Document, ICollection<ElementId>, IList<FilterRule>)
 Checks that the parameters of the given rules are valid for the given set of categories.
ClearRules
 Removes all rules from this filter.
Create(Document, String, ICollection<ElementId>)
 Creates a new ParameterFilterElement in the given document.
Create(Document, String, ICollection<ElementId>, IList<FilterRule>)
 Creates a new ParameterFilterElement in the given document.
GetCategories
 Gets the categories admitted by this filter.
GetRuleParameter
 Returns the parameter for a given filter rule.
GetRuleParameters
 Retrieves a list of the parameters associated with each rule in the filter. The order of the resulting array corresponds to the order in which the associated filter rules are applied.
GetRules
 Returns the rules of this filter, in the order in which they are applied.
SetCategories
 Sets the categories admitted by this filter.
SetRules
 Sets the rules, all of which must be satisfied for a given element to pass this filter.
Properties
Name | Description
See Also
ParameterFilterElement Class
Autodesk.Revit.DB Namespace