Revit 2018 API
ModelPath Members
The ModelPath type exposes the following members.
Methods
Name | Description
Compare
 Compares this ModelPath with another
Dispose
Releases all resources used by the ModelPath
GetModelGUID
 A GUID identifying the A360 model.
GetProjectGUID
 A GUID identifying the A360 project to which the model is associated.
Properties
Name | Description
CentralServerPath
 A path to the location of the central Revit server.
Empty
 Whether this path is empty
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ServerPath
 Whether this path is a server path (as opposed to a file path or cloud path)
See Also
ModelPath Class
Autodesk.Revit.DB Namespace