Revit 2018 API
BasePoint Members
The BasePoint type exposes the following members.
Methods
Name | Description
Properties
Name | Description
IsShared
 Indicates whether the BasePoint is shared. The project's survey point is a BasePoint which is shared.
See Also
BasePoint Class
Autodesk.Revit.DB Namespace