Revit 2018 API
Face Properties
The Face type exposes the following members.
Properties
Name | Description
Area
The area of this face.
EdgeLoops
A collection of edge loops. Each edge loop represents one of the closed boundaries of the face.
HasRegions
Identifies if the face contains regions (which can be created, for example, by the Split Face command).
IsCyclic
Indicates whether the underlying surface is periodic in the specified parametric direction.
IsTwoSided
Determines if a face is two-sided (degenerate).
MaterialElementId
The element ID of the material from which this face is composed.
OrientationMatchesSurfaceOrientation
Period
The period of the underlying surface in the specified parametric direction.
Reference
Returns a stable reference to the face.
See Also
Face Class
Autodesk.Revit.DB Namespace