Revit 2018 API
IModelExportContext Members
The IModelExportContext type exposes the following members.
Methods
Name | Description
OnCurve
 This method is called when a 3D Curve is being output.
OnLineSegment
 This method is called after unhandled 3D curve was tessellated to line segments and sent to the output.
OnPoint
 This method is called when a 3D Point is being output.
OnPolyline
 This method is called when a 3D Polyline is being output.
OnPolylineSegments
 This method is called after unhandled 3D curve was tessellated to polyline segments and sent to the output.
OnText
 This method is called when a text annoation object is being output.
See Also
IModelExportContext Interface
Autodesk.Revit.DB Namespace