Revit 2018 API
RebarFreeFormAccessor Methods
The RebarFreeFormAccessor type exposes the following members.
Methods
Name | Description
CanBeHookNormal
 A vector can be hook normal if for a bar specified by index, the bar direction is not parallel with the vector.
DisconnectFromServer
 Sets the GUID of the API server to invalid value and removes all the server related data from the Rebar (ex. the current constraints and the handle tags are removed). Calling this method will result in a Rebar that will not react to host changes anymore, however it will still have all the properties that it used to have.
Dispose
GetCustomDistributionPath
 Gets the custom distribution path for free form rebar set.
GetHookOrientationAngle
 Get the hook orientation angle at end.
GetHookPlaneNormalForBarIdx
 Returns the normal of plane in which the hook at end of bar with index barPositionIndex will stay.
GetServerGUID
 Returns the GUID of the API server.
HasValidServer
 Returns true if the current rebar contains a valid server GUID, false otherwise.
IsUnconstrained
 Returns true if the current rebar doesn't contains a valid server GUID, or contains a valid server GUID and no valid constraints.
SetCurves(IList<IList<Curve>>)
 Set the curves into a free form Rebar. Will throw exception if the rebar has valid constraints.
SetCurves(IList<CurveLoop>)
 Set the curves into a free form Rebar. Will throw exception if the rebar has valid constraints.
SetHookOrientationAngle
 Set the hook orientation angle at end. Will throw exception if the rebar has valid constraints.
SetHookPlaneNormalForBarIdx
 Set the normal of plane in which the hook at end of bar with index barPositionIndex will stay. Will throw exception if the rebar has valid constraints.
SetLayoutAsFixedNumber
 Sets the Layout Rule property of rebar set to Fixed Number.
SetLayoutAsMaximumSpacing
 Sets the Layout Rule property of rebar set to Maximum Spacing.
SetLayoutAsMinimumClearSpacing
 Sets the Layout Rule property of rebar set to Minimum Clear Spacing.
SetLayoutAsNumberWithSpacing
 Sets the Layout Rule property of rebar set to Number With Spacing.
SetLayoutAsSingle
 Sets the Layout Rule property of rebar set to Single.
See Also
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace