Revit 2018 API
AssetPropertyList Members
The AssetPropertyList type exposes the following members.
Methods
Name | Description
GetValue
 Gets collection of properties stored in this property list.
Properties
Name | Description
See Also
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace