Revit 2018 API
RebarUpdateCurvesData Members
The RebarUpdateCurvesData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RebarUpdateCurvesData
GetAttachmentType
 Returns attachment type for stirrups to be used in cover calculation.
GetBarDiameter
 Gets the diameter of the Rebar.
GetBarGeometry
 Returns the geometry for a bar at the specified index currently in the Rebar.
GetBarsNumber
 Gets the number of bars specified in the layout options. This is used to calculate the sets driven by bar number.
GetBendingRadius
 Gets the current bending radius of the rebar.
GetChangedCustomHandles
 Returns an array containing custom handles that were changed since the last regeneration. Array is empty if no handles were changed since the last regeneration.
GetCustomConstraints
 Gets all rebar constraints that are attached to custom handles for this rebar.
GetDocument
 Gets a reference to the current document.
GetEndConstraint
 Gets the current constraint for the end handle of the Rebar.
GetHookOrientationAngle
 Get the hook orientation angle at end that is currently in the rebar.
GetHookPlaneNormalForBarIdx
 Returns the normal of plane in which the hook at end of bar with index barPositionIndex that is currently in Rebar.
GetHostId
 Gets the id of the host structural for this rebar.
GetLayoutRule
 Gets the layout rule for this bar.
GetNumberOfBars
 Returns the number of bars currently in the rebar.
GetRebarStyle
 Gets the style of the rebar.
GetStartConstraint
 Gets the current constraint for the start handle of the Rebar.
SetHookOrientationAngle
 Set the hook orientation angle at end. This information is set to the rebar after the API execution is finished successfully.
SetHookPlaneNormalForBarIdx
 Set the normal of plane in which the hook at end of bar with index barPositionIndex will stay. This information is set to the rebar after the API execution is finished successfully.
Properties
Name | Description
IsAttachmentTypeChanged
 Indicates if the attachment type has changed since the last regeneration.
IsBarsNumberChanged
 Indicates if the bar number has changed since the last regeneration.
IsBendingRadiusChanged
 Indicates if the style has changed since the last regeneration.
IsEndConstraintChanged
 Indicates if the end handle constraint has changed since the last regeneration.
IsLayoutChanged
 Indicates if the layout has changed since the last regeneration.
IsSpacingChanged
 Indicates if the spacing has changed since the last regeneration.
IsStartConstraintChanged
 Indicates if the start handle constraint has changed since the last regeneration.
IsStyleChanged
 Indicates if the style has changed since the last regeneration.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Spacing
 The spacing between the bars, according to the LayoutRule.
See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace