Revit 2018 API
ModelPath Methods
The ModelPath type exposes the following members.
Methods
Name | Description
Compare
 Compares this ModelPath with another
Dispose
GetModelGUID
 A GUID identifying the A360 model.
GetProjectGUID
 A GUID identifying the A360 project to which the model is associated.
See Also
ModelPath Class
Autodesk.Revit.DB Namespace