Revit 2018 API
ConfigurationReloadInfo Methods
The ConfigurationReloadInfo type exposes the following members.
Methods
Name | Description
Dispose
GetConnectivityValidation
 Returns information about the post-reload connectivity validation.
See Also
ConfigurationReloadInfo Class
Autodesk.Revit.DB Namespace