Revit 2018 API
TopographySurface Properties
The TopographySurface type exposes the following members.
Properties
Name | Description
AssociatedBuildingPadId
 The element id of the building pad which causes this topography surface to be formed.
IsAssociatedWithBuildingPad
 Identifies if this element represents a topography surface associated with a building pad.
IsSiteSubRegion
 Identifies if this element represents a subregion.
MaterialId
 The id of the material applied to this element.
See Also
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace