Revit 2018 API
FilledRegionType Members
The FilledRegionType type exposes the following members.
Methods
Name | Description
IsValidLineWeight
 Indicates whether the given line weight value is valid.
Properties
Name | Description
Background
 The background.
Color
 The color of the fill pattern.
FillPatternId
 The fill pattern Id.
LineWeight
 The line weight of the fill pattern.
See Also
FilledRegionType Class
Autodesk.Revit.DB Namespace